// const value = prompt("Enter something");
// console.log(value);

// alert("Hello");

// const msg = confirm("Hello");
// console.log(msg);

//===============================     1

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const number = Number(prompt("Введіть число"));
// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// const number = Number(prompt("Введіть число"));
// const number = +prompt("Введіть число");

// alert(number === 10 ? "Вірно" : "Невірно");

//====================              2

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// if (min > 45) {
//   alert(`${min} входить в четверту чверть`);
// } else if (min > 30) {
//   alert(`${min} входить в третю чверть`);
// } else if (min > 15) {
//   alert(`${min} входить в другу чверть`);
// } else {
//   alert(`${min} входить в першу чверть`);
// }

//==================                 3

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const msg = +prompt("Введіть значення від 1 до 4");
// let result;

// switch (msg) {
//   case 1:
//     result = "зима";
//     break;
//   case 2:
//     result = "весна";
//     break;
//   case 3:
//     result = "літо";
//     break;
//   case 4:
//     result = "осінь";
//     break;
//   default:
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// }
// console.log(result);

//===================            4
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// const msg = +prompt("Введіть кількість хвилин");
// const hours = Math.floor(msg / 60);
// const minutes = msg % 60;
// const time = `${String(hours).padStart(2, "0")}:${String(minutes).padStart(
//   2,
//   "0"
// )}`;
// console.log(time);

//===================            5

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// const msg = prompt("Введіть логін");
// console.log(msg);

// if (msg === "Адмін") {
//   const password = prompt("Введіть пароль");
//   if (password === "Я головний") {
//     alert("Добрий день!");
//   } else {
//     alert("Невірний пароль");
//   }
// } else if (msg === null || msg === "") {
//   alert("Скасовано");
// } else {
//   alert("Я вас не знаю");
// }

//===================            6

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// let count = 0;
// while (count <= 20) {
//   console.log(count);
//   count++;
// }

//===================            7

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//   let total = 0;
//   for (i = max; i > min; i--) {
//     console.log(i);
//     if (i % 2 === 0) {
//       total += i;
//     }
//   }
//   return total;
// }
// console.log("total:", getNumbers(12, 26));

//===================            8
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// function min(a, b) {
//   if (typeof a !== "number" && typeof b !== "number") {
//     return "Not a number!";
//   }
//   return Math.min(a, b);
// }

// console.log(min(34, 54));

//===================            9

// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   }
//   const msg = confirm("Are you adult?");
//   return msg;
//   return age >= 18 || confirm("Are you adult?");
// }
// console.log(isAdult(17));
